Repository: CofficLab/GitOK
Catalog: Packages/GitOKAppCore/Sources/GitOKAppCore/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Checking destination…
zh_hans: 正在检查目标路径…
zh_hk: 正在檢查目標路徑…

source: Choose directory
zh_hans: 选择目录
zh_hk: 選擇目錄

source: Create
zh_hans: 创建
zh_hk: 建立

source: Create a new local Git repository and automatically import it into the project list.
zh_hans: 创建一个新的本地 Git 仓库，并自动导入到项目列表。
zh_hk: 建立一個新的本地 Git 儲存庫，並自動匯入到專案列表。

source: Create initial commit
zh_hans: 创建初始提交
zh_hk: 建立初始提交

source: Create README.md
zh_hans: 创建 README.md
zh_hk: 建立 README.md

source: Created
zh_hans: 已创建
zh_hk: 已建立

source: Creating repository…
zh_hans: 创建仓库中…
zh_hk: 建立儲存庫中…

source: Do not create
zh_hans: 不创建
zh_hk: 不建立

source: Final path
zh_hans: 最终路径
zh_hk: 最終路徑

source: Initial Files
zh_hans: 初始文件
zh_hk: 初始檔案

source: Local Repository
zh_hans: 本地仓库
zh_hk: 本地儲存庫

source: New Repository
zh_hans: 新建仓库
zh_hk: 新建儲存庫

source: Please enter repository name
zh_hans: 请输入仓库名称
zh_hk: 請輸入儲存庫名稱

source: Ready to create
zh_hans: 准备创建
zh_hk: 準備建立

source: Repository created, but failed to import the project list:
zh_hans: 仓库已创建，但导入项目列表失败：
zh_hk: 儲存庫已建立，但匯入專案列表失敗：

source: Repository name
zh_hans: 仓库名称
zh_hk: 儲存庫名稱

source: Repository name cannot be . or ..
zh_hans: 仓库名称不能为 . 或 ..
zh_hk: 儲存庫名稱不能為 . 或 ..

source: Repository name cannot contain /, backslash, or :
zh_hans: 仓库名称不能包含 /、\ 或 :
zh_hk: 儲存庫名稱不能包含 /、\ 或 :

source: Target directory already exists and is not empty. Please change directory or repository name
zh_hans: 目标目录已存在且不为空，请更换目录或仓库名称
zh_hk: 目標目錄已存在且不為空，請更換目錄或儲存庫名稱

source: Target path already exists as a file
zh_hans: 目标路径已存在同名文件
zh_hk: 目標路徑已存在同名檔案

source: Target path is invalid
zh_hans: 目标路径无效
zh_hk: 目標路徑無效

source: The initial commit uses the current repository or global Git user configuration; if user.name/user.email is not configured, Git will return an error.
zh_hans: 初始提交会使用当前仓库或全局 Git 用户配置；如果未配置 user.name/user.email，Git 会返回错误。
zh_hk: 初始提交會使用目前儲存庫或全域 Git 使用者設定；如果未設定 user.name/user.email，Git 會傳回錯誤。

source: The target directory already exists but is empty, allowing direct initialization as a Git repository.
zh_hans: 目标目录已存在但为空，允许直接初始化为 Git 仓库。
zh_hk: 目標目錄已存在但為空，允許直接初始化為 Git 儲存庫。

source: This directory is already in the project list
zh_hans: 该目录已经在项目列表中
zh_hk: 該目錄已經在專案列表中
